---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExportPDFSettings
source: html/e5e91430-734e-ce73-e2fa-4c592a9caad2.htm
---
# ExportPDFSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.